Tekla.Structures.Drawing.DimensionSetBaseAttributes.CurvedDimensionTypes
The type of the curved dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.CurvedDimensionTypes.Distance
The distance of the points is displayed.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.CurvedDimensionTypes.Angle
The angle is displayed.